test/nex-bzt.yml
###
# How to run:
#    1. debug/dev in Jmeter:  bzt nex-bzt.yml -gui
#    2. perf test          :  bzt nex-bzt.yml -report
###

execution:
- concurrency: 2
  ramp-up: 1m
  hold-for: 12m
  scenario: nex
      
scenarios:
  nex:
    data-sources:
    - ./test/nex-users.csv
    variables:
      hello: world
    default-address: http://localhost:8000

    requests:
    # 1. Create Product
    - url: /products
      label: products-create
      think-time: uniform(0s, 0s)
      method: POST
      headers:
        cache-control: no-cache #max-age=1800
        Content-Type: application/json
      body: 'request-body-string'
      body: >
        {
          "id": "${id}-${__javaScript(Math.random())}",
          "title": "${title}",
          "passenger_capacity": ${passenger_capacity},
          "maximum_speed": ${maximum_speed},
          "in_stock": ${in_stock}
        }          
      assert:
      - contains:
        - 200
        subject: http-code
        not: false
      extract-jsonpath:
        product_id: $.id
        default: NOT_FOUND

    - if: '"${product_id}" == "NOT_FOUND"'
      then:
        - action: continue

    # 2. Get Product
    - url: /products/${product_id}
      label: product-get
      think-time: uniform(0s, 0s)
      method: GET
        
      assert:
      - contains:
        - 200
        subject: http-code
        not: false
      extract-jsonpath:
        product_key: $.id
        default: NOT_FOUND

    # 3. Create Orders
    - url: /orders
      label: orders-create
      think-time: uniform(0s, 0s)
      method: POST
      headers:
        cache-control: no-cache  #max-age=1800
        Content-Type: application/json
      body: 'request-body-string'
      body: >
        {
          "order_details": [{"product_id": "${product_id}", "price": "100000.99", "quantity": 1}]
        }
      assert:
      - contains:
        - 200
        subject: http-code
        not: false
      extract-jsonpath:
        order_id: $.id
        default: NOT_FOUND
  
    - if: '"${order_id}" == "NOT_FOUND"'
      then:
        - action: continue
  
    # 4. Get Orders
    - url: /orders/${order_id}
      label: order-get
      think-time: uniform(0s, 0s)
      method: GET
        
      assert:
      - contains:
        - 200
        subject: http-code
        not: false
      extract-jsonpath:
        order_id: $.id
        default: NOT_FOUND
        
    - if: '"${order_id}" == "NOT_FOUND"'
      then:
        - action: continue

    # 5. Delete Product
    - url: /products/${product_id}
      label: product-delete
      think-time: uniform(0s, 0s)
      method: DELETE
        
      assert:
      - contains:
        # - 204  # Assuming HTTP 204 indicates successful deletion -- 204 increased error count. Changing to 200 for blazemeter
        - 200
        subject: http-code
        not: false

    # 6. List Orders
    - url: /orders
      label: list-orders
      think-time: uniform(0s, 0s)
      method: GET
      headers:
        cache-control: no-cache  #max-age=1800
        
      assert:
      - contains:
        - 200
        subject: http-code
        not: false
        
reporting:
- module: final-stats
  dump-xml: stats.xml